<?php if (! defined('BASEPATH')) exit("No direct script access allowed");

class M_detail extends CI_model{
	function __construct()	{
        // Call the Model constructor
		parent::__construct();
	}


	public function  retionale(){
		$detail = "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ภารกิจหลักของสถาบันอุดมศึกษา นอกเหนือจากการจัดการเรียนการสอนตามหลักสูตรแล้ว ยังจำเป็นต้องมีการส่งเสริมการศึกษาค้นคว้าวิจัย พัฒนา และเผยแพร่ความรู้ของบุคลากรในหน่วยงานไปยังท้องถิ่นสังคมภายนอกด้วย สาขาวิชาวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ คณะวิทยาศาสตร์ มีปรัชญาในการมุ่งผลิตบัณฑิตให้มีความรู้ความสามารถและทักษะด้านวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ  เพื่อตอบสนองของการทำงานของภาครัฐและเอกชน  เน้นการวิจัยเพื่อให้เป็นผู้ใฝ่ศึกษาและสามารถแก้ปัญหาได้  มุ่งเน้นคุณธรรม และการทำงานร่วมกับผู้อื่น  สามารถนำความรู้ที่ได้ไปประกอบอาชีพ  เพื่อพัฒนาตนเอง  ท้องถิ่น และประเทศชาติ  ดังนั้นนอกเหนือจากการให้นักศึกษาในสาขาวิชาฯ ได้ลงมือศึกษาค้นคว้าวิจัยและพัฒนาโครงงานของนักศึกษาของตนเพื่อไปประยุกต์ใช้กับหน่วยงานในท้องถิ่นทั้งภาครัฐและเอกชน หรือสร้างนวัตกรรมใหม่ตามวัตถุประสงค์ของงานวิจัยของตนแล้ว ทางสาขาวิชาฯ ยังต้องการเปิดโอกาสให้นักศึกษาในสาขาวิชาฯ และนักศึกษาในสถาบันการศึกษาอื่นในเขตภาคตะวันออกเฉียงเหนือ ได้เผยแพร่ผลงานวิจัยของตนให้แก่นักศึกษา อาจารย์และบุคลากรทั่วไป ทั้งภายในและภายนอกสถาบันที่มีความสนใจทางด้านวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ ให้ได้รับทราบถึงความคิดเห็น ข้อมูล องค์ความรู้ในนวัตกรรมใหม่ รวมทั้งทักษะความสามารถในการทำวิจัยของนักศึกษา อีกทั้งเพื่อเป็นการแลกเปลี่ยนความคิดเห็นข้อเสนอแนะเพิ่มเติมในการพัฒนาต่อยอดทางวิชาการและการแก้ปัญหาในการปฏิบัติงานต่อไป
		ดังนั้น สาขาวิชาวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ คณะวิทยาศาสตร์ มหาวิทยาลัยราชภัฏอุดรธานี จึงได้จัดทำโครงการการประชุมสัมมนาทางวิชาการของนักศึกษาด้านวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ ครั้งที่ ๓ ประจำปี ๒๕๕๘ ขึ้น เพื่อเป็นการแสดงผลงานวิจัยของนักศึกษาที่ทำร่วมกับอาจารย์ที่ปรึกษาของมหาวิทยาลัยราชภัฏอุดรธานี และจากมหาวิทยาลัยในเขตภาคตะวันออกเฉียงเหนือ ระหว่างในวันที่ ๒๓ – ๒๔ เมษายน พ.ศ.๒๕๕๘
		";
		return $detail;
	}

	public function  objective(){
		$detail = "<p>๑.) เพื่อเป็นการเผยแพร่ผลงานวิจัยของนักศึกษาในด้านวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศในเขตภาคตะวันออกเฉียงเหนือ ให้เป็นที่รับรู้อย่างกว้างขวางมากยิ่งขึ้น
<br/>๒.) อาจารย์ นักศึกษา และผู้ที่สนใจทางด้านคอมพิวเตอร์และเทคโนโลยี ได้รับทราบการประยุกต์ใช้งานทางด้านคอมพิวเตอร์และเทคโนโลยีสารสนเทศของนักศึกษา และทิศทางการทำวิจัยในอนาคต
<br/>๓.) เพื่อเป็นการแลกเปลี่ยนเรียนรู้ในการทำงานวิจัยทางด้านคอมพิวเตอร์และเทคโนโลยีสารสนเทศระหว่างนักศึกษาและระหว่างอาจารย์ ต่างสถาบัน </p>
" ;
return $detail;
}

public function  benefits(){
	$detail = "<p>
	๑.) นักศึกษาที่นำเสนอผลงาน มีประสบการณ์ในการนำเสนองานผลงานวิจัยในที่ประชุมทางวิชาการอันจะเป็นการสร้างชื่อเสียงทางวิชาการให้แก่ตนเอง
<br/>๒.) นักศึกษาได้พบปะ แลกเปลี่ยนความคิดเห็นและประสบการณ์ในการทำผลงานวิจัยของตนร่วมกันนักศึกษาสถาบันเดียวกันและต่างสถาบัน
<br/>๓.) นักศึกษารุ่นน้องและผู้ที่มีความสนใจทั่วไป เกิดทัศนคติที่ดีต่อการทำงานวิจัย มีแรงบันดาลใจและแนวทางในการพัฒนาที่หลากหลาย รวมถึงการต่อยอดการพัฒนาผลงานวิจัยของรุ่นพี่ที่ทำไว้ต่อไป
<br/>๔.) อาจารย์สามารถนำความรู้ความหลากหลายทางวิชาการ ด้านคอมพิวเตอร์และเทคโนโลยีสารสนเทศ ไปให้คำแนะนำกับนักศึกษาในรุ่นถัดไปเพื่อทำโครงงานวิจัยของนักศึกษาหรืองานวิจัยของอาจารย์

</p>";
return $detail;
}

public function form_of_work(){
	$detail = "<p>
	๑.) การบรรยายทางวิชาการ โดยวิทยากรบรรยายพิเศษภายนอก ๒ หัวข้อ ดังนี้
<br/>&nbsp;&nbsp;๑.๑) คุณอภิรชัย วงษ์ศรีวรพล ที่ปรึกษาเทคโนโลยีโครงการสนับสนุนการพัฒนาเทคโนโลยีของอุตสาหกรรมไทย เครือข่ายมหาวิทยาลัยขอนแก่น บรรยายในหัวข้อ “การพัฒนาเทคโนโลยีของอุตสาหกรรมไทย”
<br/>&nbsp;&nbsp;๑.๒) ผศ.ดร.ฉัตรเกล้า เจริญผล  ตำแหน่งอาจารย์ประจำภาควิชาวิทยาการคอมพิวเตอร์ คณะวิทยาการสารสนเทศ มหาวิทยาลัยสารคาม บรรยายในหัวข้อเรื่อง “แนวทางการทำวิจัยของนักศึกษาระดับอุดมศึกษาและแนวโน้มในอนาคต”
<br/>๒.) การนำเสนอผลงานวิจัยทางด้านวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศของนักศึกษา
<br/>&nbsp;&nbsp;๒.๑) การบรรยายปากเปล่า
<br/>&nbsp;&nbsp;๒.๒) การนำเสนอแบบแผ่นภาพโปสเตอร์ และแสดงการทำงานของโปรแกรมทางด้านวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศที่พัฒนาขึ้น

</p>";
return $detail;
}

public function target_group(){
	$detail ="<p>
	๑.) อาจารย์สาขาวิชาวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ และสาขาอื่นๆ ในมหาวิทยาลัยราชภัฏอุดรธานี
<br/>๒.) อาจารย์จากสถาบันการศึกษาอื่นๆ ในเขตภาคตะวันออกเฉียงเหนือ
<br/>๓.) นักศึกษาสาขาวิชาวิทยาการคอมพิวเตอร์ นักศึกษาสาขาวิชาเทคโนโลยีสารสนเทศ และนักศึกษาสาขาวิชาคอมพิวเตอร์ศึกษา ชั้นปีที่ ๒-๓-๔ จำนวน ๕๐๐ คน
<br/>๔.) นักศึกษาจากสถาบันการศึกษาอื่นๆ ในเขตภาคตะวันออกเฉียงเหนือ
<br/>๕.) บุคลากรภายนอกที่สนใจทางด้านวิทยาการคอมพิวเตอร์และเทคโนโลยีสารสนเทศ

</p>";
return $detail;
}

public function location(){
	$detail = "<p>
	๑.) ลานอเนกประสงค์ใต้อาคาร ๕ มหาวิทยาลัยราชภัฏอุดรธานี สำหรับการนำเสนอโปสเตอร์และโปรแกรมคอมพิวเตอร์ (ต้องการโต๊ะแสดงผลงาน และบอร์ดติดโปสเตอร์ จำนวน ๔๐ ชุด)
<br/>๒.) ห้องประชุมจันทร์กระพ้อ ชั้น ๓ อาคารศูนย์ฝึกประสบการณ์วิชาชีพ มหาวิทยาลัยราชภัฏอุดรธานี สำหรับการบรรยายของวิทยากรภายนอก และการนำเสนอผลงานแบบปากเปล่า

</p>";
return $detail;
}

public  function action_period(){
	$detail = "<p>
	วันที่ ๒๓ – ๒๔ เมษายน พ.ศ. ๒๕๕๘
</p>";
return $detail;
}

public function activites_carried(){
	$detail ="<p align='center'>
	<img src='".base_url()."images/pict_program_activiry/1.png' />
	<br/>
	<img src='".base_url()."images/pict_program_activiry/2.png' />
	<br/>
	<img src='".base_url()."images/pict_program_activiry/3.png' />
</p>";
return $detail;
}
public function responsible(){
	$detail ="<p align='center'><img src='".base_url()."images/pict_program_activiry/4.png' /></p>";
	return $detail;
}
}
?>